

#ifndef __CSSNVINTERFACE_H__
#define __CSSNVINTERFACE_H__

/*****************************************************************************
  1 Include Headfile
*****************************************************************************/
#include    "vos.h"


/*****************************************************************************
  1.1 Cplusplus Announce
*****************************************************************************/
#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  #pragma pack(*)    设置字节对齐方式
*****************************************************************************/
#if (VOS_OS_VER != VOS_WIN32)
#pragma pack(4)
#else
#pragma pack(push, 4)
#endif

/*****************************************************************************
  2 Macro
*****************************************************************************/

#define CSS_NV_MAX_COMM_BAND_NUM           (22)

/*****************************************************************************
  3 Massage Declare
*****************************************************************************/

/*****************************************************************************
  4 Enum
*****************************************************************************/

/*****************************************************************************
  5 STRUCT
*****************************************************************************/
/*****************************************************************************
 结构名     : CSS_BAND_PARA_STRU
 协议表格   :
 ASN.1描述  :
 结构说明   : 配置的BAND，以及该BAND对应的接入技术
*****************************************************************************/
typedef struct
{
    VOS_UINT8                           bitOpLteSupport: 1;
    VOS_UINT8                           bitOpTdsSupport: 1;
    VOS_UINT8                           bitOpWcdmaSupport: 1;
    VOS_UINT8                           bitOpGsmSupport: 1;
    VOS_UINT8                           bitOpSpare: 4;

    VOS_UINT8                           ucBandInd;
    VOS_UINT8                           aucReserved[2];
} CSS_BAND_PARA_STRU;

/*****************************************************************************
 结构名     : CSS_NV_COMM_BAND_CONFIG_STRU
 协议表格   :
 ASN.1描述  :
 结构说明   : 配置的COMM BAND信息时
*****************************************************************************/
typedef struct
{
    VOS_UINT8                           ucBandNum;
    VOS_UINT8                           aucRsv[3];
    CSS_BAND_PARA_STRU                  astBand[CSS_NV_MAX_COMM_BAND_NUM];
} CSS_NV_COMM_BAND_CONFIG_STRU;

/*****************************************************************************
 结构名     : CSS_NV_RAT_RSSI_THRESHOLD_STRU
 协议表格   :
 ASN.1描述  :
 结构说明   : 各接入技术对应的可驻留门限以及高能量门限
*****************************************************************************/
typedef struct
{
    VOS_INT16                                   sGHighRssiThresHold;/* G模对应的高能量门限值 */
    VOS_INT16                                   sGLowRssiThresHold;/* G模对应的可驻留能量门限值 */
    VOS_INT16                                   sWHighRssiThresHold;/* W模对应的高能量门限值 */
    VOS_INT16                                   sWLowRssiThresHold;/* W模对应的可驻留能量门限值 */
    VOS_INT16                                   sLHighRssiThresHold;/* L模对应的高能量门限值 */
    VOS_INT16                                   sLLowRssiThresHold;/* L模对应的可驻留能量门限值 */
} CSS_NV_RAT_RSSI_THRESHOLD_STRU;



/*****************************************************************************
  6 UNION
*****************************************************************************/


/*****************************************************************************
  7 Extern Global Variable
*****************************************************************************/


/*****************************************************************************
  8 Fuction Extern
*****************************************************************************/

/*****************************************************************************
  9 OTHERS
*****************************************************************************/










#if (VOS_OS_VER != VOS_WIN32)
#pragma pack()
#else
#pragma pack(pop)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of MmcEmmInterface.h */




