/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名      : SOCPInterface.h
  版 本 号      : 初稿
  作    者      : zhuli
  生成日期      : 2012年8月3日
  最近修改      :
  功能描述      : 该头文件为SOCP API的头文件，主要提供给外部部件使用
  函数列表      :
  修改历史      :
  1.日    期    : 2012年8月3日
    作    者    : zhuli
    修改内容    : 创建文件

******************************************************************************/
#ifndef _SOCP_INTERFACE_H_
#define _SOCP_INTERFACE_H_

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "product_config.h"
#include "mdrv_socp.h"
#include "mdrv_socp_common.h"


#endif


