/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : drv_mailbox.c
  版 本 号   : 初稿
  作    者   : 苏庄銮 59026
  生成日期   : 2012年12月15日
  最近修改   :
  功能描述   : mailbox接口
  函数列表   :

  修改历史   :
  1.日    期   : 2012年12月15日
    作    者   : 苏庄銮 59026
    修改内容   : 创建文件
******************************************************************************/

/*****************************************************************************
  1 头文件包含
*****************************************************************************/
#include "drv_mailbox_cfg.h"



#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  2 函数声明
*****************************************************************************/
/*lint -save -e752*/
#if 0
unsigned int mailbox_send_msg(
                unsigned int            mailcode,
                void                    *data,
                unsigned int            length);

unsigned int mailbox_reg_msg_cb(
                unsigned int             mailcode,
                mb_msg_cb                 func,
                void                     *data);

unsigned int mailbox_read_msg_data(
                void                   *mail_handle,
                 char                  *buff,
                unsigned int          *size);
/*lint -restore*/
#endif
/*****************************************************************************
  3 函数实现
*****************************************************************************/




#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

